app/controllers/members/home_controller.rb

  def set_genres
  	@genres = Genre.all
---
SELECT "genres".* FROM "genres"