app/controllers/members/sessions_controller.rb

 def reject_user
    @member = Member.find_by(email: params[:member][:email].downcase)
---
SELECT  "members".* FROM "members" WHERE "members"."email" = ? LIMIT ?  [["email", "ab@gmail.com"], ["LIMIT", 1]]