nagano-cake/app/controllers/members/members_controller.rb

UPDATE "members" SET "last_name" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["last_name", "のび太１"], ["updated_at", "2020-09-07 05:15:27.625317"], ["id", 1]]
---
  def update
    @member = current_member
    @member.update(member_params)

UPDATE "members" SET "is_deleted" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["is_deleted", 1], ["updated_at", "2020-09-07 05:19:30.043733"], ["id", 2]]
---
  def withdraw
    @member = current_member
    @member.update(is_deleted: true)